realDavy/BLEHomekit-Door/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESPTOOLPY_NO_STUB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=12288
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_80=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=80

# Bluetooth LE (NimBLE) for HAP-BLE
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
# CONFIG_BT_NIMBLE_ROLE_CENTRAL is not set
# CONFIG_BT_NIMBLE_ROLE_OBSERVER is not set
# CONFIG_BT_NIMBLE_NVS_PERSIST is not set
CONFIG_BT_NIMBLE_TRANSPORT_ACL_FROM_LL_COUNT=6
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=20480
CONFIG_BT_NIMBLE_HOST_ALLOW_CONNECT_WITH_SCAN=y
CONFIG_BT_NIMBLE_HOST_QUEUE_CONG_CHECK=y
CONFIG_BT_NIMBLE_ENC_ADV_DATA=y
# CONFIG_BT_NIMBLE_OPTIMIZE_MULTI_CONN is not set
# HAP pairs over GATT; disable OS SMP so iPhone Home does not drop the link
# CONFIG_BT_NIMBLE_SM_LEGACY is not set
# CONFIG_BT_NIMBLE_SM_SC is not set
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=185
CONFIG_BT_LE_SLEEP_ENABLE=y

# Crypto used by HAP pairing
CONFIG_MBEDTLS_HKDF_C=y

CONFIG_PAL_BLE_ENABLED=y
# CONFIG_PAL_NETWORK_ENABLED is not set

# BLE-only: do not compile the Wi-Fi driver. ESP32-C3 shares one RF between
# Wi-Fi and BLE; leaving Wi-Fi out keeps the radio on NimBLE only and saves
# the Wi-Fi stack's RAM/flash.
CONFIG_ESP_WIFI_ENABLED=n
# CONFIG_ESP_COEX_SW_COEXIST_ENABLE is not set

# Save RAM: this accessory is BLE-only
# CONFIG_LWIP_IPV6 is not set

# Coin-cell power: light sleep between BLE events, DFS, tickless idle
CONFIG_PM_ENABLE=y
CONFIG_PM_DFS_INIT_AUTO=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_FREERTOS_IDLE_TIME_BEFORE_SLEEP=3
CONFIG_ESP_PHY_MAC_BB_PD=y
CONFIG_PM_POWER_DOWN_PERIPHERAL_IN_LIGHT_SLEEP=y
CONFIG_ESP_SLEEP_POWER_DOWN_FLASH=y
CONFIG_ESP_SLEEP_GPIO_RESET_WORKAROUND=y
CONFIG_BOOTLOADER_SKIP_VALIDATE_IN_DEEP_SLEEP=y

# Keep serial for the setup code (no screen). After pairing, firmware
# still prints door/battery at WARN so USB debug works without extra LEDs.
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_INFO=y
